
## :x: Apply Failed

[CI link](https://github.com/kanade0404/zaim/actions/runs/11083654434)



<pre><code>Error: Error waiting for Updating Service: Error code 13, message: Revision &#39;zaim-api-00061-t84&#39; is not ready and cannot serve traffic. Image &#39;asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app:latest&#39; not found.

  with google_cloud_run_v2_service.app,
  on main.tf line 95, in resource &#34;google_cloud_run_v2_service&#34; &#34;app&#34;:
  95: resource &#34;google_cloud_run_v2_service&#34; &#34;app&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
random_uuid.uuid: Refreshing state... [id=a3f45806-e1b9-0a03-6343-8c5ef3ef14b1]
module.zaim-consumer-secret["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-secret-SEIYA]
module.zaim-oauth-secret["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-secret-SHARED]
module.zaim-consumer-secret["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-secret-SHARED]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/repositories/zaim-api]
module.zaim-consumer-key["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-key-SHARED]
module.zaim-func.google_service_account.account: Refreshing state... [id=projects/kanade0404/serviceAccounts/zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-oauth-token["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-token-SHARED]
module.zaim-consumer-key["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-key-SEIYA]
module.zaim-file.google_storage_bucket.bucket: Refreshing state... [id=zaim-kanade0404-a3f45806-e1b9-0a03-6343-8c5ef3ef14b1]
module.zaim-oauth-token["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-token-SEIYA]
module.database-url.google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/database-url]
module.zaim-oauth-secret["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-secret-SEIYA]
module.zaim-csv-folder["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/csv-folder-SHARED]
module.zaim-csv-folder["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/csv-folder-SEIYA]
module.zaim-consumer-key["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-key-SEIYA/versions/1]
module.zaim-consumer-key["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-key-SHARED/versions/1]
module.zaim-oauth-token["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-token-SHARED/versions/1]
module.zaim-consumer-secret["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-secret-SHARED/versions/1]
module.zaim-oauth-token["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-token-SEIYA/versions/1]
module.zaim-consumer-secret["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-secret-SEIYA/versions/1]
module.zaim-oauth-secret["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-secret-SHARED/versions/1]
module.zaim-oauth-secret["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-secret-SEIYA/versions/1]
module.zaim-csv-folder["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/csv-folder-SEIYA/versions/1]
module.zaim-csv-folder["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/csv-folder-SHARED/versions/1]
module.database-url.google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/database-url/versions/1]
module.zaim-func.google_project_iam_member.iam["storage.objectUser"]: Refreshing state... [id=kanade0404/roles/storage.objectUser/serviceAccount:zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-func.google_project_iam_member.iam["secretmanager.secretAccessor"]: Refreshing state... [id=kanade0404/roles/secretmanager.secretAccessor/serviceAccount:zaim-func@kanade0404.iam.gserviceaccount.com]
google_cloud_run_v2_service.app: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/services/zaim-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.app will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/kanade0404/locations/asia-northeast1/services/zaim-api"
        name                    = "zaim-api"
        # (31 unchanged attributes hidden)

      ~ template {
            # (9 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app@sha256:3872aae99f8450962e3ceb316b21bed50da6d3be473cb9f2fa058a04ac5c373e" -> "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app:latest"
                name        = "app-1"
                # (4 unchanged attributes hidden)

              - env {
                  - name  = "DATABASE_URL" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "database-url" -> null
                          - version = "1" -> null
                        }
                    }
                }
              + env {
                  + name  = "DATABASE_URL"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-url"
                          + version = (known after apply)
                        }
                    }
                }

                # (7 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.database-url.google_secret_manager_secret_version.secret-version must be replaced
-/+ resource "google_secret_manager_secret_version" "secret-version" {
      ~ create_time           = "2024-09-28T09:22:59.700480Z" -> (known after apply)
      + destroy_time          = (known after apply)
      ~ id                    = "projects/137094135185/secrets/database-url/versions/1" -> (known after apply)
      ~ name                  = "projects/137094135185/secrets/database-url/versions/1" -> (known after apply)
      ~ secret_data           = (sensitive value) # forces replacement
      ~ version               = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
module.database-url.google_secret_manager_secret_version.secret-version: Destroying... [id=projects/137094135185/secrets/database-url/versions/1]
module.database-url.google_secret_manager_secret_version.secret-version: Destruction complete after 1s
module.database-url.google_secret_manager_secret_version.secret-version: Creating...
module.database-url.google_secret_manager_secret_version.secret-version: Creation complete after 1s [id=projects/137094135185/secrets/database-url/versions/2]
google_cloud_run_v2_service.app: Modifying... [id=projects/kanade0404/locations/asia-northeast1/services/zaim-api]

Error: Error waiting for Updating Service: Error code 13, message: Revision 'zaim-api-00061-t84' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app:latest' not found.

  with google_cloud_run_v2_service.app,
  on main.tf line 95, in resource "google_cloud_run_v2_service" "app":
  95: resource "google_cloud_run_v2_service" "app" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":44,"Program":"tfcmt","SHA1":"34325108031cbd67f54430868afd53c7f06a6c6a","Vars":{},"WorkflowName":"Apply Terraform"} -->